Repository: Mulugruntz/deep_3d_photo
Catalog: locale/*/LC_MESSAGES/Deep3DPhoto.po
Languages: fr_fr

source: The {self.__class__} has no {type_} child!
fr_fr: La classe {self.__class__} n'a pas d'enfant de type {type_} !

source: Pick a file...
fr_fr: Sélectionner un fichier…

source: Pick a JPG file..
fr_fr: Sélectionner un fichier JPG…

source: Image file (jpg)
fr_fr: Fichier image (jpg)

source: Download models (required first time)
fr_fr: Télécharger les modèles (requis la première fois)

source: Downloading models...
fr_fr: Téléchargement des modèles en cours…

source: Start
fr_fr: Démarrer

source: Working, please wait...
fr_fr: Travail en cours, veuillez patienter…

source: Generate Depth file
fr_fr: Générer le fichier de profondeur

source: Generating Depth file...
fr_fr: Génération du fichier de profondeur en cours…

source: Will generate the depth...
fr_fr: La profondeur va être générée…

source: Done working: failure!
fr_fr: Travail terminé : échec !

source: Done working: success!
fr_fr: Travail terminé : succès !

source: Will start working...
fr_fr: Le travail va commencer…

source: Will start downloading the models...
fr_fr: Le téléchargement des modèles va commencer…

source: Model download: Done (failure).
fr_fr: Téléchargement des modèles : Terminé (échec).

source: Model download: Done (success).
fr_fr: Téléchargement des modèles : Terminé (succès).

source: Unknown model {model}!
fr_fr: Modèle inconnu {model} !

source: File {MODELS[name]} is incorrect (remote: {remote_size} != local: {local_size}). Will re-download.
fr_fr: Le fichier {MODELS[name]} est incorrect (distant : {remote_size} != local: {local_size}). Il sera re-téléchargé.

source: The following models are missing: {", ".join(MODELS[m] for m in missing)}! Please download them first.
fr_fr: Les modèles suivants sont manquants : {", ".join(MODELS[m] for m in missing)}! Téléchargement préalable nécessaire.

source: You can find them there:
fr_fr: Vous pouvez les trouver ici :

source: Please put them in {MODELS_DIR}
fr_fr: Veuillez les mettre dans {MODELS_DIR}

source: File {real_image_filename} does not exist!
fr_fr: Le fichier {real_image_filename} n'existe pas !

source: Depth file {from_file} is already in the correct location. No copy needed.
fr_fr: Le fichier de profondeur {from_file} est déjà dans le bon dossier. Pas de copie nécessaire.

source: Copying Depth file from {from_file} to {to_file}
fr_fr: Fichier de profondeur copié de {from_file} vers {to_file}

source: Models have not been downloaded!
fr_fr: Les modèles n'ont pas été téléchargés !

source: running on device {device}
fr_fr: lancé sur {device}

source: Current Source ==> {sample['src_pair_name']}
fr_fr: Source actuelle ==> {sample['src_pair_name']}

source: Running depth extraction at {datetime.now():%Y-%m-%d %H:%M:%S.%f}
fr_fr: Extraction de la profondeur lancée à {datetime.now():%Y-%m-%d %H:%M:%S.%f}

source: Start Running 3D_Photo ...
fr_fr: Démarrage de 3D_Photo…

source: Writing depth ply (and basically doing everything) at {datetime.now():%Y-%m-%d %H:%M:%S.%f}
fr_fr: Calcul de la profondeur ply (là où le gros du boulot se fait) à {datetime.now():%Y-%m-%d %H:%M:%S.%f}

source: Loading edge model at {datetime.now():%Y-%m-%d %H:%M:%S.%f}
fr_fr: Chargement du modèle des bords à {datetime.now():%Y-%m-%d %H:%M:%S.%f}

source: Loading depth model at {datetime.now():%Y-%m-%d %H:%M:%S.%f}
fr_fr: Chargement du modèle de profondeur à {datetime.now():%Y-%m-%d %H:%M:%S.%f}

source: Loading rgb model at {datetime.now():%Y-%m-%d %H:%M:%S.%f}
fr_fr: Chargement du modèle RGB à {datetime.now():%Y-%m-%d %H:%M:%S.%f}

source: Making video at {datetime.now():%Y-%m-%d %H:%M:%S.%f}
fr_fr: Réalisation de la vidéo à {datetime.now():%Y-%m-%d %H:%M:%S.%f}

source: {len(sample['video_postfix'])} videos done in {Path(config['video_folder']).resolve()}
fr_fr: {len(sample['video_postfix'])} vidéos faites dans {Path(config['video_folder']).resolve()}

source: Current
fr_fr: Courant

source: selected image path
fr_fr: chemin de l'image sélectionnée

source: Pick a JPG file...
fr_fr: Sélectionner un fichier JPG…

source: Load image
fr_fr: Charger image

source: selected depth path
fr_fr: chemin de la profondeur sélectionnée

source: Pick a PNG file...
fr_fr: Sélectionner un fichier PNG...

source: Image file (png)
fr_fr: Fichier image (png)

source: Load depth
fr_fr: Charger profondeur
